app/views/pages/dashboard.html.erb

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 3 AND "habit_logs"."date" = '2025-03-26' LIMIT 1
---
          <% @habits.each do |habit| %>
            <div class="habit-card <%= habit.habit_logs.find_by(date: Date.today)&.completed? ? 'completed' : 'pending' %>" data-habit-id="<%= habit.id %>">

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 3 AND "habit_logs"."date" = '2025-03-26' LIMIT 1
---
              <div class="habit-actions">
                <%= button_to habit.habit_logs.find_by(date: Date.today)&.completed? ? '✓ Completed' : 'Mark Complete',
                      toggle_today_habit_path(habit),
                      method: :patch,
                      class: 'toggle-habit-btn' %>