app/controllers/habits_controller.rb

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = 1 ORDER BY "habits"."created_at" DESC
---
  def index
    @habits = current_user.habits.order(created_at: :desc)

INSERT INTO "habits" ("name", "description", "frequency", "active", "user_id", "created_at", "updated_at") VALUES ('Test Habit', '', 'daily', 1, 2, '2025-04-19 15:47:49.276384', '2025-04-19 15:47:49.276384') RETURNING "id"
---
  def create
    @habit = current_user.habits.new(habit_params)

    if @habit.save

DELETE FROM "habits" WHERE "habits"."id" = 1
---
  def destroy
    @habit.destroy

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 2 AND "habit_logs"."date" = '2025-04-07' LIMIT 1
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = 1 AND "habits"."id" = 2 LIMIT 1
---
  def toggle_today
    # Check if there's a log for today
    today = Date.today
    log = @habit.habit_logs.find_or_initialize_by(date: today)

    # Set the user association
    log.user = current_user

    # Toggle the completed status
    log.completed = !log.completed

    if log.save
      redirect_to request.referer || habits_path, notice: "Habit status updated."
    else
      redirect_to request.referer || habits_path, alert: log.errors.full_messages.join(", ")

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = 1 AND "habits"."id" = 1 LIMIT 1
---
  def set_habit
    @habit = current_user.habits.find(params[:id])