app/controllers/pages_controller.rb

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = 2 ORDER BY "habits"."created_at" DESC
---
  def home
    if logged_in?
      # Get the user's habits (loaded server-side)
      @user = current_user
      @habits = current_user.habits.order(created_at: :desc)