app/controllers/progress_controller.rb

SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = 1 AND "habits"."active" = 1
SELECT COUNT(*) FROM "habits" WHERE "habits"."user_id" = 1 AND "habits"."active" = 1
---
  def index
    @habits = current_user.habits.active
    @progress_data = @habits.map do |habit|
      {
        id: habit.id,
        name: habit.name,
        frequency: habit.frequency,
        current_streak: habit.current_streak,
        best_streak: habit.best_streak,
        completion_rate: habit.completion_rate,
        completion_rate_7_days: habit.completion_rate(7.days.ago.beginning_of_day),
        completion_rate_30_days: habit.completion_rate(30.days.ago.beginning_of_day)
      }
    end

    @total_habits = @habits.count