app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "full_name", "email", "bio", "timezone", "avatar") VALUES ('Samiuddin', '$2a$12$hOFKtgh1q9mASslqRowq4egSjAfHHMw17TudgFD33lQRABHl/VLcG', '2025-03-26 17:09:27.708678', '2025-03-26 17:09:27.708678', NULL, NULL, NULL, NULL, NULL) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    if session[:user_id]
      @user = User.find(session[:user_id])