app/views/habits/index.html.erb

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 1 AND "habit_logs"."date" = '2025-03-26' LIMIT 1
---
            <% @habits.each do |habit| %>
              <div class="habit-card <%= habit.habit_logs.find_by(date: Date.today)&.completed? ? 'completed' : 'pending' %>" data-habit-id="<%= habit.id %>">

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 1 AND "habit_logs"."date" = '2025-03-26' LIMIT 1
---
                <div class="habit-actions">
                  <%= button_to habit.habit_logs.find_by(date: Date.today)&.completed? ? '✓ Completed' : 'Mark Complete',
                            toggle_today_habit_path(habit),
                            method: :patch,
                            class: 'toggle-habit-btn' %>

SELECT COUNT(*) FROM "habit_logs" WHERE "habit_logs"."habit_id" = 1 AND "habit_logs"."date" BETWEEN '2025-03-01' AND '2025-03-26' AND "habit_logs"."completed" = 1
---
              <% if @habits.any? %>
                <%= ((@habits.sum { |habit| habit.habit_logs.where(date: Date.today.beginning_of_month..Date.today, completed: true).count }.to_f /
                     (@habits.count * (Date.today.day))) * 100).round %>%