app/views/habits/show.html.erb

SELECT COUNT(*) FROM "habit_logs" WHERE "habit_logs"."habit_id" = 2 AND "habit_logs"."completed" = 1
---
                total_days = [total_days, 1].max
                completed_days = @habit.habit_logs.where(completed: true).count

SELECT COUNT(*) FROM "habit_logs" WHERE "habit_logs"."habit_id" = 2 AND "habit_logs"."completed" = 1
---
            <h3>Total Completions</h3>
            <div class="stat-value"><%= @habit.habit_logs.where(completed: true).count %></div>

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 2 AND "habit_logs"."date" BETWEEN '2025-04-01' AND '2025-04-30'
---
            # Fetch all logs for the month
            monthly_logs = @habit.habit_logs.where(date: start_date..end_date).index_by(&:date)

SELECT "habit_logs".* FROM "habit_logs" WHERE "habit_logs"."habit_id" = 2 ORDER BY "habit_logs"."date" DESC LIMIT 20
---
          <%
            logs = @habit.habit_logs.order(date: :desc).limit(20)